vanvught/GD32F407RE-DMX512-RDM/lib-network/src/apps/ntp/gd32/ptp/ntpclient.cpp
/**
 * @file ntpclient.cpp
 * @brief Implementation of an NTP client with interleave mode for time synchronization in a standalone embedded environment.
 *
 * This file implements the functionality to synchronize system time using the Network Time Protocol (NTP).
 * It uses PTP to communicate with an NTP server and adjusts the system clock based on received timestamps.
 *
 * @note This implementation is optimized for Cortex-M3/M4/M7 processors and assumes a standalone environment
 *       without a standard library.
 */
/* Copyright (C) 2024-2026 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/**
 * https://www.ietf.org/archive/id/draft-ietf-ntp-interleaved-modes-07.html#name-interleaved-client-server-m
 */
/*
Server   t2   t3               t6   t7              t10  t11
    -----+----+----------------+----+----------------+----+-----
        /      \              /      \              /      \
Client /        \            /        \            /        \
    --+----------+----------+----------+----------+----------+--
      t1         t4         t5         t8         t9        t12

Mode: B         B           I         I           I         I
    +----+    +----+      +----+    +----+      +----+    +----+
Org | 0  |    | t1~|      | t2 |    | t4 |      | t6 |    | t8 |
Rx  | 0  |    | t2 |      | t4 |    | t6 |      | t8 |    |t10 |
Tx  | t1~|    | t3~|      | t1 |    | t3 |      | t5 |    | t7 |
    +----+    +----+      +----+    +----+      +----+    +----+

T1 - local transmit timestamp of the latest request (t5)
T2 - remote receive timestamp from the latest response (t6)
T3 - remote transmit timestamp from the latest response (t3)
T4 - local receive timestamp of the previous response (t4)
 */

#if defined(CONFIG_NET_ENABLE_NTP_CLIENT)
#error
#endif

#pragma GCC push_options
#pragma GCC optimize("O3")
#pragma GCC optimize("no-tree-loop-distribute-patterns")

#include <cstdint>
#include <cstring>
#include <sys/time.h>
#include <cstdlib>
#include <cstdio>
#include <ctime>

#include "configstore.h"
#include "network_udp.h"
#include "core/protocol/iana.h"
#include "core/protocol/ntp.h"
#include "apps/ntpclient.h"
#include "gd32_ptp.h"
#include "softwaretimers.h"

#if defined DEBUG_PTP_NTP_CLIENT
#define NTP_CLIENT_DEBUG_ENTRY() DEBUG_ENTRY()
#define NTP_CLIENT_DEBUG_EXIT() DEBUG_EXIT()
#define NTP_CLIENT_DEBUG_PRINTF(...) DEBUG_PRINTF(__VA_ARGS__)
#define NTP_CLIENT_DEBUG_PUTS(...) DEBUG_PUTS(__VA_ARGS__)
#else
#define NTP_CLIENT_DEBUG_ENTRY() \
    do {                         \
    } while (false)
#define NTP_CLIENT_DEBUG_EXIT() \
    do {                        \
    } while (false)
#define NTP_CLIENT_DEBUG_PRINTF(...) \
    do {                             \
    } while (false)
#define NTP_CLIENT_DEBUG_PUTS(...) \
    do {                           \
    } while (false)
#endif

namespace net::globals::ptp {
extern uint32_t timestamp[2];
} // namespace net::globals::ptp

#define _NTPFRAC_(x) ((4294U * (x)) + ((1981U * (x)) >> 11) + ((2911U * (x)) >> 28))
#define NTPFRAC(x) _NTPFRAC_(x / 1000)
// The reverse of the above, needed if we want to set our microsecond
// clock (via clock_settime) based on the incoming time in NTP format.
// Basically exact.
#define USEC(x) (((x) >> 12) - 759 * ((((x) >> 10) + 32768) >> 16))

struct NtpClient {
    uint32_t server_ip;
    int32_t handle;
    TimerHandle_t timer_id;
    uint32_t request_timeout_seconds;
    uint32_t poll_seconds;
    uint32_t locked_count;
    const ntp::Packet* reply;
    ntp::Status status;
    ntp::Packet request;
    ntp::TimeStamp t1; // time request sent by client
    ntp::TimeStamp t2; // time request received by server
    ntp::TimeStamp t3; // time reply sent by server
    ntp::TimeStamp t4; // time reply received by client
    ntp::TimeStamp cookie_basic;
    struct {
        ntp::TimeStamp previous_receive;
        ntp::TimeStamp dst; // destination timestamp
        ntp::TimeStamp sent_a;
        ntp::TimeStamp sent_b;
        int32_t x; // interleave switch
        uint32_t missed_responses;
#ifdef DEBUG_PTP_NTP_CLIENT
        ntp::Modes mode;
#endif
    } state;
};

static NtpClient s_ntp_client;
static uint16_t s_id;
static constexpr uint16_t kRequestSize = sizeof s_ntp_client.request;

static void Print([[maybe_unused]] const char* text, [[maybe_unused]] const struct ntp::TimeStamp* timestamp) {
#ifdef DEBUG_PTP_NTP_CLIENT
    const auto kSeconds = static_cast<time_t>(timestamp->seconds - ntp::kJan1970);
    const auto* local_time = localtime(&kSeconds);
    printf("%s %02d:%02d:%02d.%06d %04d [%u][0x%.8x]\n", 
      text, 
      static_cast<int>(local_time->tm_hour), 
      static_cast<int>(local_time->tm_min), 
      static_cast<int>(local_time->tm_sec), 
      static_cast<int>(USEC(timestamp->fraction)), 
      local_time->tm_year + 1900, 
      static_cast<int>(timestamp->seconds), 
      static_cast<unsigned>(timestamp->fraction));
#endif
}

static void Process();

